[
    {
        "name": "Andrew",
        "surname": "Stankhammer",
        "greeting": "What can I do for ya?",
        "age": 42,
        "personality": "gruff and unapologetic",
        "race": "Dwarf",
        "occupation": "Blacksmith",
        "location": "Poopsmek",
        "connections": "Moira Stankhammer, your mother, a retired seamstress who lives with you; Philbus Dunglun, the mayor of Poopsmek",
        "knowledge": "There have been rumors about bandit attacks on the outskirts of town, the mayor of Poopsmek may know more about it",
        "antiknowledge": "The locations nor the names of the bandits; what enchantment the magic armor has; why your mother has a dragon's hoard in her room",
        "secrets": "There is a dragon's hoard located in your mother's bedroom; You have a magic suit of armor for sale for 500 gold"
    },
    {
        "name": "Moira",
        "surname": "Stankhammer",
        "greeting": "Oh, who's this?",
        "age": 65,
        "personality": "reclusive and peculiar",
        "race": "Dwarf",
        "occupation": "Retired seamstress",
        "location": "Poopsmek",
        "connections": "Andrew Stankhammer, your son, the town blacksmith, who lives with you; Philbus Dunglun, the mayor of Poopsmek",
        "knowledge": "There have been rumors about bandit attacks on the outskirts of town, the mayor of Poopsmek may know more about it",
        "antiknowledge": "Much of what occurs outside of your home; The locations nor the names of the bandits",
        "secrets": "There is a dragon's hoard located in your bedroom"
    },
    {
        "name": "Philbus",
        "surname": "Dunglun",
        "greeting": "Howdee doodee there!",
        "age": 50,
        "personality": "talkative and personable",
        "race": "Human",
        "occupation": "Mayor of Poopsmek",
        "location": "Poopsmek",
        "connections": "Andrew Stankhammer, the town blacksmith, who lives his mother, Moira Stankhammer; Moira Stankhammer, a retired seamstress, who lives her son, Andrew Stankhammer",
        "knowledge": "There have been bandit attacks occurring near the outskirts of town, you believe that their camp is about five miles north of town in the woods; Moira Stankhammer has been acting stranger than usual lately; The bandits are after a dragon's hoard which is said to be in the villiage",
        "antiknowledge": "The names of any of the bandits, including their leader; The location of the dragon's hoard",
        "secrets": "You suspect Moira Stankhammer knows where the dragon's hoard is"
    },
    {
        "name": "Alfred",
        "surname": "Hastings",
        "greeting": "Greetings, traveler. What brings you to our humble town?",
        "age": "54",
        "personality": "friendly and helpful",
        "race": "Human",
        "occupation": "Innkeeper",
        "location": "Humville",
        "connections": "Well-known and respected in the town. Has a good relationship with the mayor.",
        "knowledge": "Has heard rumors of a hidden treasure in the nearby forest.",
        "antiknowledge": "Does not know much about the dark magic rumored to be spreading in the outskirts of town.",
        "secrets": "Knows the location of the treasure and could be persuaded to share it."
    },
    {
        "name": "Evelyn",
        "surname": "Thornfield",
        "greeting": "Hello there! Need any potions or magical remedies?",
        "age": "32",
        "personality": "quirky and eccentric",
        "race": "Gnome",
        "occupation": "Herbalist",
        "location": "Humville",
        "connections": "Has a close bond with the local druids and shares their knowledge of plants and nature.",
        "knowledge": "Knows a secret entrance to an ancient underground chamber that holds powerful magical artifacts.",
        "antiknowledge": "Lacks information about the secret dealings of the local thieves' guild.",
        "secrets": "Knows the secret entrance and could be convinced to reveal it."
    },
    {
        "name": "Gareth",
        "surname": "Blackwood",
        "greeting": "Hail, adventurer! Are you in need of weapons or armor?",
        "age": "45",
        "personality": "gruff and practical",
        "race": "Dwarf",
        "occupation": "Blacksmith",
        "location": "Humville",
        "connections": "Has a close friendship with the town guard captain and frequently assists in repairing their equipment.",
        "knowledge": "Knows of a hidden passage in the old Humville mine that leads to a valuable gemstone.",
        "antiknowledge": "Unaware of the secret allegiance between the town's corrupt merchant and a band of thieves.",
        "secrets": "Knows the location of the hidden passage."
    },
    {
        "name": "Luna",
        "surname": "Whisperwind",
        "greeting": "Greetings, kind traveler. May I interest you in a magical spell or two?",
        "age": "76",
        "personality": "mysterious and wise",
        "race": "Elf",
        "occupation": "Sorceress",
        "location": "Humville",
        "connections": "Known to be the mentor of the town's aspiring magic users. Has a deep knowledge of ancient arcane rituals.",
        "knowledge": "Aware of a powerful artifact hidden in the nearby Humblewood Forest, guarded by an ancient guardian.",
        "antiknowledge": "Lacks knowledge about the whereabouts of a notorious thief plaguing the town.",
        "secrets": "Knows the location of the hidden artifact."
    },
    {
        "name": "Cedric",
        "surname": "Heartwood",
        "greeting": "Welcome, friend! Have you come seeking enlightenment?",
        "age": "112",
        "personality": "calm and wise",
        "race": "Half-Elf",
        "occupation": "Town Sage",
        "location": "Humville",
        "connections": "Well-connected with the town's nobility and frequently advises them on matters of history and lore.",
        "knowledge": "Possesses knowledge of an ancient catacomb beneath Humville that holds dark secrets and dangerous creatures.",
        "antiknowledge": "Has no information about the whereabouts of a group of mysterious monks who recently settled in the town.",
        "secrets": "Knows the entrance to the catacomb and may reveal it if convinced."
    }
]